{
    "about": {
      "en": "About me",
      "hu": "Rólam"
    },
    "button": {
      "en": "Switch to Hungarian",
      "hu": "Váltás Angol Nyelvre"
    },
    "experience": {
        "en": "Experience",
        "hu": "Tapasztalatok"
      },
      "education": {
        "en": "Education",
        "hu": "Tanulmányok"
      },
      "skills": {
        "en": "Skills",
        "hu": "Készségek"
      },
      "interests": {
        "en": "Interests",
        "hu": "Érdeklődési kör"
      },
      "about-text": {
        "en": "",
        "hu": ""
      },
      "about-text2": {
        "en": "",
        "hu": ""
      },
      "engineer": {
        "en": "Quality laboratory engineer",
        "hu": "Minőségirányítási Labormérnök"
      },
      "engineer2": {
        "en": "Scheduling and execution of laboratory measurements in accordance with market, product development and quality management requirements. Documentation, recording and reporting of measurements. Analysis of improperly functioning devices, development of new measurement and simulation procedures for more in‑depth examination.",
        "hu": "Labormérések ütemezése, kivitelezése a piaci, termékfejlesztési és minőségirányítási igényeknek megfelelően. Ezen mérések dokumentálása, jegyzőkönyvezése, riportálása. Nem megfelelően működő készülékek elemzése, behatóbb vizsgálatához új mérési és szimulációs eljárások kidolgozása."
      },
      "technician": {
        "en": "Process Analyst Technician",
        "hu": "Folyamatelemző Technikus"
      },
      "technician2": {
        "en": "Supports of Laboratory Engineers , organization and supervision of background process supporting measurements.",
        "hu": "Labormérnökök támogatása, méréseket támogató háttér folyamatok szervezése, felügyelete."
      },
      "petrol": {
        "en": "Petrol station operator",
        "hu": "Töltőállomás kezelő"
      },
      "petrol2": {
        "en": "Operation of petrol stations and cash registers.",
        "hu": "Töltőállomások és pénztárgép kezelése."
      },
      "sales": {
        "en": "Direct Sales",
        "hu": "Direkt Értékesítő"
      },
      "sales2": {
        "en": " Presentation and sale of the company's products and services, recording of requests in the company's systems.  ",
        "hu": "A vállalat termékeinek és szolgáltatásainak bemutatása, értékesítése, igénybejelentések rögzítése a vállalat rendszereiben."
      },
      "education2": {
        "en": "Computer Science, Software Developer specialisation",
        "hu": "Programtervező informatikus, Fejlesztő specializáció"
      },
      
      "graduation": {
        "en": "Graduation",
        "hu": "Érettségi"
      },
      "welding": {
        "en": "MAG welding",
        "hu": "Fogyóelektródás Védőgázas Ívhegesztő"
      },
      "tinsmith": {
        "en": "tinsmith",
        "hu": "Épület És Építménybádogos"
      },
      "english": {
        "en": "English language communication level",
        "hu": "Angol nyelv kommunikációs szinten"
      },
      "50001": {
        "en": "ISO 5001:2018 Internal Auditor",
        "hu": "ISO 5001:2018 Belső Auditor"
      },
      "9001": {
        "en": "ISO 9001-ISO 14001 Internal Auditor",
        "hu": "ISO 9001-ISO 14001 Belső Auditor"
      },
      "fire": {
        "en": "Fire Protection Exam Category 1 and 2",
        "hu": "Tűzvédelmi Szakvizsga 1. És 2. kategória"
      },
      "excel": {
        "en": "Advanced Excel course",
        "hu": "Haladó Excel Tanfolyam"
      },
      "certificates": {
        "en": "Certificates",
        "hu": "Tanusítványok"
      },
      "interests2": {
        "en": "Primarily, I am interested in everything related to computer science. I enjoy keeping up with the latest developments in the field and understanding them, whether they are software or hardware related. I like to experiment and contemplate solutions to problems that arise, or research them. Thus, it can be said that computer science is my main hobby. I enjoy the challenges it presents, such as creating dual-triple boot systems, where for example, one can install Windows, Linux, and even MacOS on a non-Apple computer. I started tinkering with computers as a hobby when I was 12 years old. At that time, I had a Pentium 1 computer with DOS and Norton Commander. Since then, a lot has happened, and much has changed. I have learned a lot and developed my skills. I have built and configured numerous computers, repaired laptops, and set up home networks and servers.",
        "hu": "Elsősorban minden ami informatika. Szeretek az informatika újdonságaival és azok megértésével foglalkozni. Legyen az szoftveres vagy hardveres eredetű. Szeretek kísérletezni, és a felmerülő problémák megoldásán töprengeni, vagy kutatni utánuk. Így mondhatjuk, hogy az informatika a fő hobbim. Szeretem a benne rejlő kihívásokat. Például dual-triple boot rendszerek létrehozását, ahol mondjuk egy nem apple rendszerű gépen windows és linux mellé, akár egy macos-t is fel lehet ügyeskedni. 12 éves koromban kezdtem el hobbi szinten a számítógépekkel foglalkozni. Akkor még egy Pentium 1-es számítógéppel, DOS én Norton Commander párossal. Azóta sok minden történt, és sok minden változott, sokat tanultam és sokat fejlődtem. Építettem, konfiguráltam számítógépeket, javítottam laptopokat, kiépítettem otthoni hálózatokat, szervereket."
      },
      "interests3": {
        "en": "Additionally, I really enjoy reading, hiking, cycling, going to concerts, and spending time with friends.",
        "hu": "Emellett nagyon szeretek olvasni, túrázni, kerékpározni, koncertre és társaságba járni."
      },
      "demo": {
        "en": "My works",
        "hu": "Munkáim"
      },
      "demo-text": {
        "en": "This was a course project for Server-side and Client-side programming that eventually grew into a complete system. It includes security features, email verification, and access control. A DEMO version of the application that excludes certain functions is available by clicking on the image below.",
        "hu": "Szerver és kliensoldali programozás tárgyra készült beadandó feladat, ami végül egy teljes rendszerré nőtte ki magát. Biztonsági funkciókkal, email hitelesítéssel, jogosultság kezeléssel. Ezen alkalmazás DEMO és bizonyos funkcióktól mentes változata érhető el az alábbi képre kattintva."
      },
      "download": {
        "en": "Download CV",
        "hu": "Önéletrajzom letöltése"
      },
      "cookie":{
        "en": "Cookies Consent",
        "hu": "Sütik Elfogadása"
      },
      "cookie-text":{
        "en": "This website uses cookies to ensure you get the best experience on our website.",
        "hu": "Ez a weboldal sütiket használ a legjobb felhasználói élmény biztosítása érdekében."
      },
      "cookie-accept":{
        "en": "Accept",
        "hu": "Elfogadom"
      },
      "CvDown":{
        "en": "Download CV",
        "hu": "Önéletrajz letöltése"
      },
      "CvChoose":{
        "en": "Choose a language",
        "hu": "Válassza ki a nyelvet"
      },
      "Registry":{
        "en": "Registry webapp",
        "hu": "Nyilvántartó"
      },
      "MyWorks":{
        "en": "My Works",
        "hu": "Munkáim"
      },
      "Weather":{
        "en": "Android Weather App",
        "hu": "Android Időjárás App"
      },

      "principal_technician": {
        "en": "Principal Software and Hardware Technician",
        "hu": "Vezető Szoftver és Hardver Technikus"
      },

        "principal": {
          "en": "Providing software and hardware support for the development of the Calibration Executive software. My primary task was the creation of development and test environments, maintenance, updating, full-scale supervision and development of Laboratory IT devices. In addition to these, I was also responsible for the development of smaller software for internal use.",
          "hu": "Szoftveres és hardveres támogatást nyújtottam a Calibration Executive szoftver fejlesztéséhez. Elsődleges feladatom volt a fejlesztési és tesztkörnyezetek létrehozása, karbantartása, frissítése, valamint a Laboratóriumi IT eszközök teljes körű felügyelete és fejlesztése. Emellett belső használatra szánt, a labor működését egyszerűsítő automatizáló kisebb szoftverek fejlesztésében is részt vettem."
        },
      
      "prod_dev": {
        "en": "Product Development Engineer",
        "hu": "Termékfejlesztési Mérnök"
      },
      
    "dev": {
      "en": "Pre‑configuration of the components of the products to be manufactured (installation of firmware) during the production process, as well as the development and implementation of the final quality control of the assembled products at the IT, software and hardware level. Automation of processes that can be automated from these.",
      "hu": "A gyártandó termékek komponenseinek előzetes nagy darabszámú konfigurálásának (firmware‑ek telepítése) kidolgozása a gyártási folyamat során, valamint az összeszerelt termékek végső minőség és működés ellenőrzésének kidolgozása és megvalósítása IT, szoftver és hardver szinten. Ezekből automatizálható folyamtok automatizálása, akár egyedileg fejlesztett, írt szkriptekkel, szoftverekkel"
    }




























  }